app/controllers/ideas_controller.rb

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE "comments"."idea_id" = ?  [["idea_id", 2]]
---
  def show
     @idea = Idea.find(params[:id])
     @comments = @idea.comments.all

INSERT INTO "ideas" ("created_at", "description", "name", "picture", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-06 16:27:27.572014"], ["description", "los problemitas"], ["name", "arreglando"], ["picture", ""], ["updated_at", "2014-09-06 16:27:27.572014"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save